pftbest/msp430_svd/msp430-gcc-support-files/targetdb/Modules/msp430/LEA_367.0.xml
<module id="LEA" HW_revision="367.0">
    <register id="LEACAP" width="32" offset="0x0" internal="0" description="LEA Capability Register">
        <bitfield id="LEAMSIZ" description="LEA Code Memory Size. This register identifies the size of available code RAM." begin="3" end="0" width="4" rwaccess="R">
            <bitenum id="LEAMSIZ_0" value="0x0" description="no code RAM"/>
            <bitenum id="LEAMSIZ_1" value="0x1" description="1KB Code RAM"/>
        </bitfield>
    </register>
    <register id="LEACNF0" width="32" offset="0x4" internal="0" description="Configuration Register 0">
        <bitfield id="LEASWRST" description="LEA module software restart. Setting this bit to one restarts the LEA module. As long this bit remains set to one the LEA is held in Restart. (The LEA accessible memory behaves as system RAM)" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="LEAFTHOLD" description="Hold on faults and NMIs for all pending LEA operations transfers.This is for all system wide fault/NMI cases (for our first implementation we may just consider local LEA triggered fault cases)" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="LEAFTHOLD_0" value="0x0" description="LEA transfers continue on faults/NMIs"/>
            <bitenum id="LEAFTHOLD_1" value="0x1" description="LEA transfers enter HOLD on faults/NMIs"/>
        </bitfield>
        <bitfield id="LEALPR" description="This bit defined if command execution shall be continued in LPM modes" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="LEALPR_0" value="0x0" description="LEA command execution stops in deep low power modes"/>
            <bitenum id="LEALPR_1" value="0x1" description="LEA command execution continues in deep low power modes"/>
        </bitfield>
        <bitfield id="LEAILPM" description="This bit defines if a &quot;Command done interrupt&quot; shall be triggered in LPM mode" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="LEAILPM_0" value="0x0" description="Interrupt of LEA is suppressed in LPM mode until AM is entered then the LEA interrupt is triggered as well"/>
            <bitenum id="LEAILPM_1" value="0x1" description="Interrupt of LEA is always triggered on completion of an LEA command"/>
        </bitfield>
        <bitfield id="LEAILB" description="LEA instruction loop buffer disable. Debugging function for LEA (leave it zero)." begin="11" end="11" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="LEATIMFLTE" description="LEA module timer fault enable." begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="LEATIMFLT_0" value="0x0" description="LEA module timer timeout will not cause a fault indication"/>
            <bitenum id="LEATIMFLTE_1" value="0x1" description="LEA module timer timeout will cause a fault indication. LEA stops operation and enters &quot;Ready-state&quot;."/>
        </bitfield>
        <bitfield id="LEACFLT" description="LEAHPCFLTE when hardware trigger available later Enable bit on peripheral mapped command faults and hardware triggered command faults." begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="LEACFLT_0" value="0x0" description="LEAHPCFLT is disabled"/>
            <bitenum id="LEACFLT_1" value="0x1" description="LEAHPCFLT is enabled"/>
        </bitfield>
        <bitfield id="LEAMEMFLTE" description="Enable bit on memory faults." begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="LEAMEMFLTE_0" value="0x0" description="LEA memory faults are disabled"/>
            <bitenum id="LEAMEMFLTE_1" value="0x1" description="LEA memory faults are enabled"/>
        </bitfield>
        <bitfield id="LEADONES" description="LEA done event indication and set flag. This bit indicated the done event for LEA. This bit can be set by writing a one to it. Writing a zero has no effect." begin="16" end="16" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="LEAFREES" description="LEA free event indication and set flag. This bit indicated the free event for LEA. This bit can be set by writing a one to it. Writing a zero has no effect." begin="17" end="17" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="LEATIMFLTS" description="LEA timeout fault indication and set flag; This bits indicates that timer timeout occurred. This fault may also be set by writing a one to it. Writing a zero has no effect.The corresponding terminal is connected to one of the UNMI inputs of the SYS module (A package option)" begin="21" end="21" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="LEACFLTS" description="LEAHPCFLTS when hardware trigger enabled later LEA command fault on peripheral interface or hardware triggered indication and set flag; This bits indicates that a command was invoked that is not implemented. This fault is also signaled to the SYS module as a &quot;User-NMI&quot; when enabled. Only one fault condition is signaled until this bit is cleared. Leaving this bit set will not cause any further faults. This fault may also be set by writing a one to it. Writing a zero has no effect.The corresponding terminal is connected to one of the UNMI inputs of the SYS module." begin="22" end="22" width="1" rwaccess="R/W">
            <bitenum id="LEACFLTS_0" value="0x0" description="No command fault occurred since this bit was cleared"/>
            <bitenum id="LEACFLTS_1" value="0x1" description="At least one command fault occurred since this bit was cleared"/>
        </bitfield>
        <bitfield id="LEAMEMFLTS" description="LEA memory fault indication and set flag. This bit indicates that a fault in the memory VBUS interface occurred. The exact fault reason may be identified by checking LEACNF1. LEAWRSTAT and LEACNF1.LEARDSTAT." begin="23" end="23" width="1" rwaccess="R/W">
            <bitenum id="LEAMEMFLTS_0" value="0x0" description="No memory fault occurred since this bit was cleared"/>
            <bitenum id="LEAMEMFLTS_1" value="0x1" description="At least one memory fault since this bit was cleared"/>
        </bitfield>
        <bitfield id="LEATRST" description="LEA module timer reset. Setting this bit to one clears LEA module timer. This bit is self clearing and will always be read as zero." begin="24" end="24" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="LEATEN" description="LEA timer enable; writing a one to this bit enables LEA timer operations." begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="LEATISEL" description="LEA timer interval select. These bits select LEA timer interval. t#sub#CLK#/sub# = 1 / f#sub#CLK#/sub# f#sub#CLK#/sub# = MCLK" begin="31" end="28" width="4" rwaccess="R/W">
            <bitenum id="LEATISEL_0" value="0x0" description="Timeout period: 128 x t#sub#CLK#/sub# (16 us at 8 MHz); Interval period: 256 x t#sub#CLK#/sub# (32 us at 8 MHz)"/>
            <bitenum id="LEATISEL_1" value="0x1" description="Timeout period: 256 x t#sub#CLK#/sub# (32 us at 8 MHz); Interval period: 512 x t#sub#CLK#/sub# (64 us at 8 MHz)"/>
            <bitenum id="LEATISEL_2" value="0x2" description="Timeout period: 512 x t#sub#CLK#/sub# (64 us at 8 MHz); Interval period: 1024 x t#sub#CLK#/sub# (128 us at 8 MHz)"/>
            <bitenum id="LEATISEL_3" value="0x3" description="Timeout period: 1024 x t#sub#CLK#/sub# (128 us at 8 MHz); Interval period: 2048 x t#sub#CLK#/sub# (256 us at 8 MHz)"/>
            <bitenum id="LEATISEL_4" value="0x4" description="Timeout period: 2048 x t#sub#CLK#/sub# (256 us at 8 MHz); Interval period: 4096 x t#sub#CLK#/sub# (512 us at 8 MHz)"/>
            <bitenum id="LEATISEL_5" value="0x5" description="Timeout period: 4096 x t#sub#CLK#/sub# (512 us at 8 MHz); Interval period: 8192 x t#sub#CLK#/sub# (1ms at 8 MHz)"/>
            <bitenum id="LEATISEL_6" value="0x6" description="Timeout period: 8192 x t#sub#CLK#/sub# (1 ms at 8 MHz); Interval period: 16384 x t#sub#CLK#/sub# (2 ms at 8 MHz)"/>
            <bitenum id="LEATISEL_7" value="0x7" description="Timeout period: 16384 x t#sub#CLK#/sub# (2 ms at 8 MHz); Interval period: 32768 x t#sub#CLK#/sub# (4 ms at 8 MHz)"/>
            <bitenum id="LEATISEL_8" value="0x8" description="Timeout period: 32768 x t#sub#CLK#/sub# (4ms at 8 MHz); Interval period: 65536 x t#sub#CLK#/sub# (8 ms at 8 MHz)"/>
            <bitenum id="LEATISEL_9" value="0x9" description="Timeout period: 65536 x t#sub#CLK#/sub# (8 ms at 8 MHz); Interval period: 131072 x t#sub#CLK#/sub# (16 ms at 8 MHz)"/>
            <bitenum id="LEATISEL_10" value="0xA" description="Timeout period: 131072 x t#sub#CLK#/sub# (16 ms at 8 MHz); Interval period: 262144 x t#sub#CLK#/sub# (32 ms at 8 MHz)"/>
            <bitenum id="LEATISEL_11" value="0xB" description="Timeout period: 524288 x t#sub#CLK#/sub# (65 ms at 8 MHz); Interval period: 1048576 x t#sub#CLK#/sub# (131 ms at 8 MHz)"/>
            <bitenum id="LEATISEL_12" value="0xC" description="Timeout period: 1048576 x t#sub#CLK#/sub# (131 ms at 8 MHz); Interval period: 2097152 x t#sub#CLK#/sub# (262 ms at 8 MHz)"/>
            <bitenum id="LEATISEL_13" value="0xD" description="Timeout period: 2097152 x t#sub#CLK#/sub# (262 ms at 8 MHz); Interval period: 4194304 x t#sub#CLK#/sub# (524 ms at 8 MHz)"/>
            <bitenum id="LEATISEL_14" value="0xE" description="Timeout period: 4194304 x t#sub#CLK#/sub# (524 ms at 8 MHz); Interval period: 8388608 x t#sub#CLK#/sub# (1.05 s at 8 MHz)"/>
            <bitenum id="LEATISEL_15" value="0xF" description="Timeout period: 8388608 x t#sub#CLK#/sub# (1.05 s at 8 MHz); Interval period: 16777216 x t#sub#CLK#/sub# (2.1 s at 8 MHz)"/>
        </bitfield>
    </register>
